const china = [
    "北京",
    "天津",
    "河北",
    "山西",
    "内蒙古",
    "辽宁",
    "吉林",
    "黑龙江",
    "上海",
    "江苏",
    "浙江",
    "安徽",
    "福建",
    "江西",
    "山东",
    "河南",
    "湖北",
    "湖南",
    "广东",
    "广西",
    "海南",
    "重庆",
    "四川",
    "贵州",
    "云南",
    "西藏",
    "陕西",
    "甘肃",
    "青海",
    "宁夏",
    "新疆",
    "香港特别行政区",
    "澳门特别行政区",
    "中国台湾",
]
const economic = [
    { id: 'yga', label: '粤港澳大湾区', province: ['香港特别行政区', '澳门特别行政区', '广东',] },
    { id: 'zsj', label: '珠江三角洲', province: ['广州市','深圳市','珠海市','佛山市','惠州市','东莞市','中山市','江门市','肇庆市'] },
    { id: 'csj', label: '长江三角洲', province: ['上海', '江苏', '浙江'] },
    { id: 'hbh', label: '环渤海经济区', province: ['北京', '天津', '河北', '辽宁', '山东'] }
]
const geography = [
    {
        id: 'east', label: '东部', province: [
            "北京",
            "上海",
            "天津",
            "河北",
            "山东",
            "江苏",
            "浙江",
            "福建",
            "广东",
        ]
    },
    {
        id: 'center', label: '中部', province: [
            "山西",
            "河南",
            "湖北",
            "安徽",
            "湖南",
            "江西",
            "海南"
        ]
    },
    {
        id: 'west', label: '西部', province: [
            "新疆",
            "甘肃",
            "内蒙古",
            "西藏",
            "青海",
            "宁夏",
            "陕西",
            "四川",
            "重庆",
            "云南",
            "贵州",
            "广西",
        ]
    }, {
        id: 'north-east', label: '东北', province: [
            "黑龙江", "吉林", "辽宁"
        ]
    }
]
const citys = [
    {id:'297', label: '297城', province:['合肥市']}
]
const geographyType = {
    'east': [
        "北京",
        "上海",
        "天津",
        "河北",
        "山东",
        "江苏",
        "浙江",
        "福建",
        "广东",
    ],
    'center': [
        "山西",
        "河南",
        "湖北",
        "安徽",
        "湖南",
        "江西",
        "海南"
    ],
    'west': [
        "新疆",
        "甘肃",
        "内蒙古",
        "西藏",
        "青海",
        "宁夏",
        "陕西",
        "四川",
        "重庆",
        "云南",
        "贵州",
        "广西",
    ],
    'north-east': [
        "黑龙江", "吉林", "辽宁"
    ]
}
const industryType = {
    //农业型
    'agriculture': [
        "四川",
        "云南",
        "贵州",
        "新疆",
        "广西",
        "河北",
        "辽宁",
        "吉林",
        "黑龙江",
        "湖南",
    ],
    //农服型
    'agri-server': [
        "海南",
        "甘肃"
    ],
    //工农型
    'indu-agri': [
        "湖北",
        "安徽",
        "江西",
        "河南",
        "青海",
        "内蒙古",
        "陕西",
        "宁夏",
        "山东",
    ],
    //工业型
    'industry': [
        "江苏",
        "福建",
        "重庆",
        "山西"
    ],
    //工服型
    'indu-server': [
        "广东",
        "浙江"
    ],
    //服务型
    'server': [
        "北京",
        "上海",
        "天津"
    ]
}
export { economic, geography, china, citys, industryType,geographyType}