const randomData = [
    13,
    24,
    11,
    27,
    31,
    33,
    12,
    43,
    18,
    29,
    42,
    35,
    45,
    23,
    42,
    26,
    4,
    27,
    24,
    30,
    33,
    28,
    49,
    2,
    33,
    36,
    2,
    26,
    24,
    8,
    24,
    2
]

const randomTweenData = [
    [[13,24],[11,26],[31,30],[29,28],[8,13],[9,16],[7,4],[19,22],[16,33],[5,15],[9,18],[4,11]],
    [[2,3],[4,1],[50,23],[11,45],[32,19],[13,12],[4,20],[3,29],[5,16]],
    [[8,2],[2,6],[13,19],[33,44],[40,50],[13,40],[1,9]],
    [[8,7],[42,11],[18,23]],
]
const province = [
    "北京",
    "天津",
    "上海",
    "重庆",
    "河北",
    "山西",
    "辽宁",
    "吉林",
    "黑龙江",
    "江苏",
    "浙江",
    "安徽",
    "福建",
    "江西",
    "山东",
    "河南",
    "湖北",
    "湖南",
    "广东",
    "海南",
    "四川",
    "贵州",
    "云南",
    "陕西",
    "甘肃",
    "青海",
    "内蒙古",
    "广西",
    "西藏",
    "宁夏",
    "新疆",
]

const defaultColor = [
    '#f34a4a',
    "#3c3cec",
    "#ffe600",
    "#43f324"
]

const geography = [
    {id:'west',label:'西部',children:['新疆','甘肃','内蒙古','西藏','青海','宁夏','陕西','四川','重庆','云南','贵州','广西']},
    {id:'east',label:'东部',children:['北京','上海','天津','河北','山东','江苏','浙江','福建','广东']},
    {id:'center',label:'中部',children:['山西','河南','湖北','安徽','湖南','江西','海南']},
    {id:'north-east',label:'东北部',children:['黑龙江','吉林','辽宁']},
]


export {randomData,randomTweenData,defaultColor,province,geography}
